burakenez/gd32e51x-demo-suites-cmake-vscode/Projects/GD32E517V_START/05_TIMER_Key_EXTI/GD32E51x_CL.svd
        <register>
          <name>ADCTRIGS0</name>
          <displayName>ADCTRIGS0</displayName>
          <description>SHRTIMER trigger source 0 to ADC register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRG0ST4PER</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER4 period event</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST4C3</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER4 compare 3 event</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST4C2</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER4 compare 2 event</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST4C1</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER4 compare 1 event</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST3PER</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER3 period event</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST3C3</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER3 compare 3 event</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST3C2</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER3 compare 2 event</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST3C1</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER3 compare 1 event</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST2PER</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER2 period event</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>TRG0ST2C3</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER2 compare 3 event</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST2C2</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER2 compare 2 event</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST2C1</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER2 compare 1 event</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST1RST</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER1 reset</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST1PER</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER1 period event</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST1C3</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER1 compare 3 event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST1C2</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER1 compare 2 event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST1C1</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER1 compare 1 event</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST0RST</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER0 reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST0PER</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER0 period event</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST0C3</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER0 compare 3 event</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST0C2</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER0 compare 2 event</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0ST0C1</name>
              <description>SHRTIMER_ADCTRIG0 on Slave_TIMER0 compare 1 event</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0EXEV4</name>
              <description>SHRTIMER_ADCTRIG0 on external event 4</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0EXEV3</name>
              <description>SHRTIMER_ADCTRIG0 on external event 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0EXEV2</name>
              <description>SHRTIMER_ADCTRIG0 on external event 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0EXEV1</name>
              <description>SHRTIMER_ADCTRIG0 on external event 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0EXEV0</name>
              <description>SHRTIMER_ADCTRIG0 on external event 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0MTPER</name>
              <description>SHRTIMER_ADCTRIG0 on Master_TIMER period event</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0MTC3</name>
              <description>SHRTIMER_ADCTRIG0 on Master_TIMER compare 3 event</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0MTC2</name>
              <description>SHRTIMER_ADCTRIG0 on Master_TIMER compare 2 event</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0MTC1</name>
              <description>SHRTIMER_ADCTRIG0 on Master_TIMER compare 1 event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG0MTC0</name>
              <description>SHRTIMER_ADCTRIG0 on Master_TIMER compare 0 event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

       <register>
          <name>ADCTRIGS1</name>
          <displayName>ADCTRIGS1</displayName>
          <description>SHRTIMER trigger source 1 to ADC register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRG1ST4RST</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER4 reset </description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST4C3</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER4 compare 3 event</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST4C2</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER4 compare 2 event</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST4C1</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER4 compare 1 event</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST3RST</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER3 reset </description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST3PER</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER3 period event</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST3C3</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER3 compare 3 event</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST3C2</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER3 compare 2 event</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST3C1</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER3 compare 1 event</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST2RST</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER2 reset </description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST2PER</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER2 period event</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST2C3</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER2 compare 3 event</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST2C2</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER2 compare 2 event</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST2C1</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER2 compare 1 event</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST1PER</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER1 period event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST1C3</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER1 compare 3 event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST1C2</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER1 compare 2 event</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST1C1</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER1 compare 1 event</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST0PER</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER0 period event</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST0C3</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER0 compare 3 event</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST0C2</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER0 compare 2 event</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1ST0C1</name>
              <description>SHRTIMER_ADCTRIG1 on Slave_TIMER0 compare 1 event</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1EXEV9</name>
              <description>SHRTIMER_ADCTRIG1 on external event 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1EXEV8</name>
              <description>SHRTIMER_ADCTRIG1 on external event 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1EXEV7</name>
              <description>SHRTIMER_ADCTRIG1 on external event 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1EXEV6</name>
              <description>SHRTIMER_ADCTRIG1 on external event 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1EXEV5</name>
              <description>SHRTIMER_ADCTRIG1 on external event 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1MTPER</name>
              <description>SHRTIMER_ADCTRIG1 on Master_TIMER period event</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1MTC3</name>
              <description>SHRTIMER_ADCTRIG1 on Master_TIMER compare 3 event</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1MTC2</name>
              <description>SHRTIMER_ADCTRIG1 on Master_TIMER compare 2 event</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1MTC1</name>
              <description>SHRTIMER_ADCTRIG1 on Master_TIMER compare 1 event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRG1MTC0</name>
              <description>SHRTIMER_ADCTRIG1 on Master_TIMER compare 0 event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

