burakenez/gd32e51x-demo-suites-cmake-vscode/Projects/GD32E517V_START/05_TIMER_Key_EXTI/GD32E51x_CL.svd
       <register>
          <name>DMAUPMTR</name>
          <displayName>DMAUPMTR</displayName>
          <description>SHRTIMER DMA update Master_TIMER register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MTACTL</name>
              <description>SHRTIMER_MTACTL update by DMA mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTCMP3V</name>
              <description>SHRTIMER_MTCMP3V update by DMA mode </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTCMP2V</name>
              <description>SHRTIMER_MTCMP2V update by DMA mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTCMP1V</name>
              <description>SHRTIMER_MTCMP1V update by DMA mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTCMP0V</name>
              <description>SHRTIMER_MTCMP0V update by DMA mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTCREP</name>
              <description>SHRTIMER_MTCAR update by DMA mode </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>MTCAR</name>
              <description>SHRTIMER_MTCAR update by DMA mode </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTCNT</name>
              <description>SHRTIMER_MTCNT update by DMA mode </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
            <field>
              <name>MTDMAINTEN</name>
              <description>SHRTIMER_MTDMAINTEN update by DMA mode </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTINTC</name>
              <description>SHRTIMER_MTINTC update by DMA mode </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTCTL0</name>
              <description>SHRTIMER_MTCTL0 update by DMA mode </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

       <register>
          <name>DMAUPST0R</name>
          <displayName>DMAUPST0R</displayName>
          <description>SHRTIMER DMA update Slave_TIMER0 register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST0ACTL</name>
              <description>SHRTIMER_ST0ACTL update by DMA mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0FLTCTL</name>
              <description>SHRTIMER_ST0FLTCTL update by DMA mode </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CHOCTL</name>
              <description>SHRTIMER_ST0CHOCTL update by DMA mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CSCTL</name>
              <description>SHRTIMER_ST0CSCTL update by DMA mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CNTRST</name>
              <description>SHRTIMER_ST0CNTRST update by DMA mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0EXEVFCFG1</name>
              <description>SHRTIMER_ST0EXEVFCFG1update by DMA mode </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>ST0EXEVFCFG0</name>
              <description>SHRTIMER_ST0EXEVFCFG0update by DMA mode </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CH1RST</name>
              <description>SHRTIMER_ST0CH1RST update by DMA mode </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
            <field>
              <name>ST0CH1SET</name>
              <description>SHRTIMER_ST0CH1SET update by DMA mode </description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CH0RST</name>
              <description>SHRTIMER_ST0CH0RST update by DMA mode </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CH0SET</name>
              <description>SHRTIMER_ST0CH0SET update by DMA mode </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0DTCTL</name>
              <description>SHRTIMER_ST0DTCTL update by DMA mode </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CMP3V</name>
              <description>SHRTIMER_ST0CMP3V update by DMA mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CMP2V</name>
              <description>SHRTIMER_ST0CMP2V update by DMA mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CMP1V</name>
              <description>SHRTIMER_ST0CMP1V update by DMA mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CMP0V</name>
              <description>SHRTIMER_ST0CMP0V update by DMA mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CREP</name>
              <description>SHRTIMER_ST0CREP update by DMA mode </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CAR</name>
              <description>SHRTIMER_ST0CAR update by DMA mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CNT</name>
              <description>SHRTIMER_ST0CNT update by DMA mode </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0DMAINTEN</name>
              <description>SHRTIMER_ST0DMAINTEN update by DMA mode </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0INTC</name>
              <description>SHRTIMER_ST0INTC update by DMA mode </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CTL0</name>
              <description>SHRTIMER_ST0CTL0 update by DMA mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

       <register>
          <name>DMAUPST1R</name>
          <displayName>DMAUPST1R</displayName>
          <description>SHRTIMER DMA update Slave_TIMER1 register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST1ACTL</name>
              <description>SHRTIMER_ST1ACTL update by DMA mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1FLTCTL</name>
              <description>SHRTIMER_ST1FLTCTL update by DMA mode </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CHOCTL</name>
              <description>SHRTIMER_ST1CHOCTL update by DMA mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CSCTL</name>
              <description>SHRTIMER_ST1CSCTL update by DMA mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CNTRST</name>
              <description>SHRTIMER_ST1CNTRST update by DMA mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1EXEVFCFG1</name>
              <description>SHRTIMER_ST1EXEVFCFG1update by DMA mode </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>ST1EXEVFCFG0</name>
              <description>SHRTIMER_ST1EXEVFCFG0update by DMA mode </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CH1RST</name>
              <description>SHRTIMER_ST1CH1RST update by DMA mode </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
            <field>
              <name>ST1CH1SET</name>
              <description>SHRTIMER_ST1CH1SET update by DMA mode </description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CH0RST</name>
              <description>SHRTIMER_ST1CH0RST update by DMA mode </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CH0SET</name>
              <description>SHRTIMER_ST1CH0SET update by DMA mode </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1DTCTL</name>
              <description>SHRTIMER_ST1DTCTL update by DMA mode </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CMP3V</name>
              <description>SHRTIMER_ST1CMP3V update by DMA mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CMP2V</name>
              <description>SHRTIMER_ST1CMP2V update by DMA mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CMP1V</name>
              <description>SHRTIMER_ST1CMP1V update by DMA mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CMP0V</name>
              <description>SHRTIMER_ST1CMP0V update by DMA mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CREP</name>
              <description>SHRTIMER_ST1CREP update by DMA mode </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CAR</name>
              <description>SHRTIMER_ST1CAR update by DMA mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CNT</name>
              <description>SHRTIMER_ST1CNT update by DMA mode </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1DMAINTEN</name>
              <description>SHRTIMER_ST1DMAINTEN update by DMA mode </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1INTC</name>
              <description>SHRTIMER_ST1INTC update by DMA mode </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CTL0</name>
              <description>SHRTIMER_ST1CTL0 update by DMA mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

       <register>
          <name>DMAUPST2R</name>
          <displayName>DMAUPST2R</displayName>
          <description>SHRTIMER DMA update Slave_TIMER2 register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST2ACTL</name>
              <description>SHRTIMER_ST2ACTL update by DMA mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2FLTCTL</name>
              <description>SHRTIMER_ST2FLTCTL update by DMA mode </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CHOCTL</name>
              <description>SHRTIMER_ST2CHOCTL update by DMA mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CSCTL</name>
              <description>SHRTIMER_ST2CSCTL update by DMA mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CNTRST</name>
              <description>SHRTIMER_ST2CNTRST update by DMA mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2EXEVFCFG1</name>
              <description>SHRTIMER_ST2EXEVFCFG1update by DMA mode </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>ST2EXEVFCFG0</name>
              <description>SHRTIMER_ST2EXEVFCFG0update by DMA mode </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CH1RST</name>
              <description>SHRTIMER_ST2CH1RST update by DMA mode </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
            <field>
              <name>ST2CH1SET</name>
              <description>SHRTIMER_ST2CH1SET update by DMA mode </description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CH0RST</name>
              <description>SHRTIMER_ST2CH0RST update by DMA mode </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CH0SET</name>
              <description>SHRTIMER_ST2CH0SET update by DMA mode </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2DTCTL</name>
              <description>SHRTIMER_ST2DTCTL update by DMA mode </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CMP3V</name>
              <description>SHRTIMER_ST2CMP3V update by DMA mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CMP2V</name>
              <description>SHRTIMER_ST2CMP2V update by DMA mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CMP1V</name>
              <description>SHRTIMER_ST2CMP1V update by DMA mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CMP0V</name>
              <description>SHRTIMER_ST2CMP0V update by DMA mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CREP</name>
              <description>SHRTIMER_ST2CREP update by DMA mode </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CAR</name>
              <description>SHRTIMER_ST2CAR update by DMA mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CNT</name>
              <description>SHRTIMER_ST2CNT update by DMA mode </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2DMAINTEN</name>
              <description>SHRTIMER_ST2DMAINTEN update by DMA mode </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2INTC</name>
              <description>SHRTIMER_ST2INTC update by DMA mode </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CTL0</name>
              <description>SHRTIMER_ST2CTL0 update by DMA mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

