burakenez/gd32e51x-demo-suites-cmake-vscode/Projects/GD32E517V_START/05_TIMER_Key_EXTI/GD32E51x_CL.svd
       <register>
          <name>DMAUPST3R</name>
          <displayName>DMAUPST3R</displayName>
          <description>SHRTIMER DMA update Slave_TIMER3 register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST3ACTL</name>
              <description>SHRTIMER_ST3ACTL update by DMA mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3FLTCTL</name>
              <description>SHRTIMER_ST3FLTCTL update by DMA mode </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CHOCTL</name>
              <description>SHRTIMER_ST3CHOCTL update by DMA mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CSCTL</name>
              <description>SHRTIMER_ST3CSCTL update by DMA mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CNTRST</name>
              <description>SHRTIMER_ST3CNTRST update by DMA mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3EXEVFCFG1</name>
              <description>SHRTIMER_ST3EXEVFCFG1update by DMA mode </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>ST3EXEVFCFG0</name>
              <description>SHRTIMER_ST3EXEVFCFG0update by DMA mode </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CH1RST</name>
              <description>SHRTIMER_ST3CH1RST update by DMA mode </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
            <field>
              <name>ST3CH1SET</name>
              <description>SHRTIMER_ST3CH1SET update by DMA mode </description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CH0RST</name>
              <description>SHRTIMER_ST3CH0RST update by DMA mode </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CH0SET</name>
              <description>SHRTIMER_ST3CH0SET update by DMA mode </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3DTCTL</name>
              <description>SHRTIMER_ST3DTCTL update by DMA mode </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CMP3V</name>
              <description>SHRTIMER_ST3CMP3V update by DMA mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CMP2V</name>
              <description>SHRTIMER_ST3CMP2V update by DMA mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CMP1V</name>
              <description>SHRTIMER_ST3CMP1V update by DMA mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CMP0V</name>
              <description>SHRTIMER_ST3CMP0V update by DMA mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CREP</name>
              <description>SHRTIMER_ST3CREP update by DMA mode </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CAR</name>
              <description>SHRTIMER_ST3CAR update by DMA mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CNT</name>
              <description>SHRTIMER_ST3CNT update by DMA mode </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3DMAINTEN</name>
              <description>SHRTIMER_ST3DMAINTEN update by DMA mode </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3INTC</name>
              <description>SHRTIMER_ST3INTC update by DMA mode </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CTL0</name>
              <description>SHRTIMER_ST3CTL0 update by DMA mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

       <register>
          <name>DMAUPST4R</name>
          <displayName>DMAUPST4R</displayName>
          <description>SHRTIMER DMA update Slave_TIMER4 register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST4ACTL</name>
              <description>SHRTIMER_ST4ACTL update by DMA mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4FLTCTL</name>
              <description>SHRTIMER_ST4FLTCTL update by DMA mode </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CHOCTL</name>
              <description>SHRTIMER_ST4CHOCTL update by DMA mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CSCTL</name>
              <description>SHRTIMER_ST4CSCTL update by DMA mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CNTRST</name>
              <description>SHRTIMER_ST4CNTRST update by DMA mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4EXEVFCFG1</name>
              <description>SHRTIMER_ST4EXEVFCFG1update by DMA mode </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>ST4EXEVFCFG0</name>
              <description>SHRTIMER_ST4EXEVFCFG0update by DMA mode </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CH1RST</name>
              <description>SHRTIMER_ST4CH1RST update by DMA mode </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
            <field>
              <name>ST4CH1SET</name>
              <description>SHRTIMER_ST4CH1SET update by DMA mode </description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CH0RST</name>
              <description>SHRTIMER_ST4CH0RST update by DMA mode </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CH0SET</name>
              <description>SHRTIMER_ST4CH0SET update by DMA mode </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4DTCTL</name>
              <description>SHRTIMER_ST4DTCTL update by DMA mode </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CMP3V</name>
              <description>SHRTIMER_ST4CMP3V update by DMA mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CMP2V</name>
              <description>SHRTIMER_ST4CMP2V update by DMA mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CMP1V</name>
              <description>SHRTIMER_ST4CMP1V update by DMA mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CMP0V</name>
              <description>SHRTIMER_ST4CMP0V update by DMA mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CREP</name>
              <description>SHRTIMER_ST4CREP update by DMA mode </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CAR</name>
              <description>SHRTIMER_ST4CAR update by DMA mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CNT</name>
              <description>SHRTIMER_ST4CNT update by DMA mode </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4DMAINTEN</name>
              <description>SHRTIMER_ST4DMAINTEN update by DMA mode </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4INTC</name>
              <description>SHRTIMER_ST4INTC update by DMA mode </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CTL0</name>
              <description>SHRTIMER_ST4CTL0 update by DMA mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

       <register>
          <name>DMATB</name>
          <displayName>DMATB</displayName>
          <description>SHRTIMER DMA transfer buffer register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMATB</name>
              <description>DMA transfer buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
