burakenez/gd32e51x-demo-suites-cmake-vscode/Projects/GD32E517V_START/05_TIMER_Key_EXTI/GD32E51x_CL.svd
     <register>
          <name>IPR36</name>
          <displayName>IPR36</displayName>
          <description>Interrupt Priority Register 36</description>
          <addressOffset>0x324</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_36</name>
              <description>PRI_36</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR37</name>
          <displayName>IPR37</displayName>
          <description>Interrupt Priority Register 37</description>
          <addressOffset>0x325</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_37</name>
              <description>PRI_37</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR38</name>
          <displayName>IPR38</displayName>
          <description>Interrupt Priority Register 38</description>
          <addressOffset>0x326</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_38</name>
              <description>PRI_38</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR39</name>
          <displayName>IPR39</displayName>
          <description>Interrupt Priority Register 39</description>
          <addressOffset>0x327</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_39</name>
              <description>PRI_39</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR40</name>
          <displayName>IPR40</displayName>
          <description>Interrupt Priority Register 40</description>
          <addressOffset>0x328</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_40</name>
              <description>PRI_40</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR41</name>
          <displayName>IPR41</displayName>
          <description>Interrupt Priority Register 41</description>
          <addressOffset>0x329</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_41</name>
              <description>PRI_41</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR42</name>
          <displayName>IPR42</displayName>
          <description>Interrupt Priority Register 42</description>
          <addressOffset>0x32A</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_42</name>
              <description>PRI_42</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR43</name>
          <displayName>IPR43</displayName>
          <description>Interrupt Priority Register 43</description>
          <addressOffset>0x32B</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_43</name>
              <description>PRI_43</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR44</name>
          <displayName>IPR44</displayName>
          <description>Interrupt Priority Register 44</description>
          <addressOffset>0x32C</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_44</name>
              <description>PRI_44</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR45</name>
          <displayName>IPR45</displayName>
          <description>Interrupt Priority Register 45</description>
          <addressOffset>0x32D</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_45</name>
              <description>PRI_45</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR46</name>
          <displayName>IPR46</displayName>
          <description>Interrupt Priority Register 46</description>
          <addressOffset>0x32E</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_46</name>
              <description>PRI_46</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR47</name>
          <displayName>IPR47</displayName>
          <description>Interrupt Priority Register 47</description>
          <addressOffset>0x32F</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_47</name>
              <description>PRI_47</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR48</name>
          <displayName>IPR48</displayName>
          <description>Interrupt Priority Register 48</description>
          <addressOffset>0x330</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_48</name>
              <description>PRI_48</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
    <register>
          <name>IPR49</name>
          <displayName>IPR49</displayName>
          <description>Interrupt Priority Register 49</description>
          <addressOffset>0x331</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_49</name>
              <description>PRI_49</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR50</name>
          <displayName>IPR50</displayName>
          <description>Interrupt Priority Register 50</description>
          <addressOffset>0x332</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_50</name>
              <description>PRI_50</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR51</name>
          <displayName>IPR51</displayName>
          <description>Interrupt Priority Register 51</description>
          <addressOffset>0x333</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_51</name>
              <description>PRI_51</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR52</name>
          <displayName>IPR52</displayName>
          <description>Interrupt Priority Register 52</description>
          <addressOffset>0x334</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_52</name>
              <description>PRI_52</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR53</name>
          <displayName>IPR53</displayName>
          <description>Interrupt Priority Register 53</description>
          <addressOffset>0x335</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_53</name>
              <description>PRI_53</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR54</name>
          <displayName>IPR54</displayName>
          <description>Interrupt Priority Register 54</description>
          <addressOffset>0x336</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_54</name>
              <description>PRI_54</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR55</name>
          <displayName>IPR55</displayName>
          <description>Interrupt Priority Register 55</description>
          <addressOffset>0x337</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_55</name>
              <description>PRI_55</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR56</name>
          <displayName>IPR56</displayName>
          <description>Interrupt Priority Register 56</description>
          <addressOffset>0x338</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_56</name>
              <description>PRI_56</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR57</name>
          <displayName>IPR57</displayName>
          <description>Interrupt Priority Register 57</description>
          <addressOffset>0x339</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_57</name>
              <description>PRI_57</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR58</name>
          <displayName>IPR58</displayName>
          <description>Interrupt Priority Register 58</description>
          <addressOffset>0x33A</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_58</name>
              <description>PRI_58</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR59</name>
          <displayName>IPR59</displayName>
          <description>Interrupt Priority Register 59</description>
          <addressOffset>0x33B</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_59</name>
              <description>PRI_59</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR60</name>
          <displayName>IPR60</displayName>
          <description>Interrupt Priority Register 60</description>
          <addressOffset>0x33C</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_60</name>
              <description>PRI_60</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR61</name>
          <displayName>IPR61</displayName>
          <description>Interrupt Priority Register 61</description>
          <addressOffset>0x33D</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_61</name>
              <description>PRI_61</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR62</name>
          <displayName>IPR62</displayName>
          <description>Interrupt Priority Register 62</description>
          <addressOffset>0x33E</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_62</name>
              <description>PRI_62</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR63</name>
          <displayName>IPR63</displayName>
          <description>Interrupt Priority Register 63</description>
          <addressOffset>0x33F</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_63</name>
              <description>PRI_63</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR64</name>
          <displayName>IPR64</displayName>
          <description>Interrupt Priority Register 64</description>
          <addressOffset>0x340</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_64</name>
              <description>PRI_64</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
    <register>
          <name>IPR65</name>
          <displayName>IPR65</displayName>
          <description>Interrupt Priority Register 65</description>
          <addressOffset>0x341</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_65</name>
              <description>PRI_65</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR66</name>
          <displayName>IPR66</displayName>
          <description>Interrupt Priority Register 66</description>
          <addressOffset>0x342</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_66</name>
              <description>PRI_66</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR67</name>
          <displayName>IPR67</displayName>
          <description>Interrupt Priority Register 67</description>
          <addressOffset>0x343</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_67</name>
              <description>PRI_67</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>STIR</name>
          <displayName>STIR</displayName>
          <description>Software Trigger Interrupt Register</description>
          <addressOffset>0xE00</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIR</name>
              <description>STIR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
