burakenez/gd32e51x-demo-suites-cmake-vscode/Projects/GD32E517V_START/05_TIMER_Key_EXTI/GD32E51x_CL.svd
      <register>
        <name>DMATB</name>
        <displayName>DMATB</displayName>
        <description>DMA transfer buffer register</description>
        <addressOffset>0x4C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DMATB</name>
              <description>DMA transfer buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CFG</name>
        <displayName>CFG</displayName>
        <description>Configuration register</description>
        <addressOffset>0xFC</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CHVSEL</name>
              <description>Write CHxVAL register selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTSEL</name>
              <description>The output value selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
    </registers>
</peripheral>
<peripheral derivedFrom="TIMER15">
            <name>TIMER16</name>
            <groupName>TIMER</groupName>
            <baseAddress>0x40014800</baseAddress>
            <interrupt>
        <name>TIMER0_TRG_CMT_TIMER10_TIMER16</name>
        <value>26</value>
      </interrupt>
        </peripheral>

    <peripheral>
      <name>TMU</name>
      <description>TMU</description>
      <groupName>TMU</groupName>
      <baseAddress>0x40080000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TMU</name>       
        <value>87</value>
      </interrupt>
      <registers>
      <register>
          <name>IDATA0</name>
          <displayName>IDATA0</displayName>
          <description>Input data0 register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x3F800000</resetValue>
          <fields>
            <field>
              <name>IDATA0</name>
              <description>IDATA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>IDATA1</name>
          <displayName>IDATA1</displayName>
          <description>Input data1 register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x3F800000</resetValue>
          <fields>
            <field>
              <name>IDATA1</name>
              <description>IDATA1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <displayName>CTL</displayName>
          <description>Control register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
           <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CFIF</name>
              <description>CFIF</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFIE</name>
              <description>CFIE</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>Set the mode of TMU</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMUEN</name>
              <description>start TMU module calculation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA0</name>
          <displayName>DATA0</displayName>
          <description> data0 register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x34000000</resetValue>
          <fields>
            <field>
              <name>DATA0</name>
              <description>DATA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>DATA1</name>
          <displayName>DATA1</displayName>
          <description> data1 register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA1</name>
              <description>DATA1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
       </register>
       <register>
          <name>STAT</name>
          <displayName>STAT</displayName>
          <description> Status register </description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UDRF</name>
              <description>The flag of underflow</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRF</name>
              <description>The flag of overflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
